Repository: Hains/Kreversi
Catalog: po/*/kreversi.po
Languages: eo

# NAME OF TRANSLATORS
source: Your names
eo: Wolfram Diestel,Oliver Kellogg

# EMAIL OF TRANSLATORS
source: Your emails
eo: wolfram@steloj.de,okellogg@users.sourceforge.net

source: Blue
eo: Blua

source: Red
eo: Ruĝa

source: Black
eo: Negra

source: White
eo: Blanka

source: Score
eo: Poentaro

source: Mean Score
eo: Meza Poentaro

source: Best Score
eo: Plej bona Poentaro

source: Elapsed Time
eo: Pasinta tempo

# @title:tab
source: Best &Scores
eo: Plej bonaj &Poentoj

# @title:tab
source: &Players
eo: &Ludantoj

# @title:tab
source: Statistics
eo: Statistiko

# @title:tab
source: Histogram
eo: Histogramo

source: View world-wide highscores
eo: Rigardi tutmondajn altpoentarojn

source: View world-wide players
eo: Rigardi tutmondajn ludantojn

# @title:window
source: Highscores
eo: Altpoentaroj

source: Winner
eo: Venkinto

source: Won Games
eo: Gajnitaj Ludoj

# @title:window
source: Configure Highscores
eo: Agordi Highscores

# @title:tan
source: Main
eo: Ĉefa

# @label:textbox
source: Nickname:
eo: Kromnomo:

# @label:textbox
source: Comment:
eo: Komento:

# @option:check
source: World-wide highscores enabled
eo: Tutmondaj altpoentaroj ebligitaj

# @title:tab
source: Advanced
eo: Altnivela

# @title:group
source: Registration Data
eo: Registradaj Datumoj

# @label:textbox
source: Key:
eo: Ŝlosilo:

# @action:button
source: Remove
eo: Forigi

source: This will permanently remove your registration key. You will not be able to use the currently registered nickname anymore.
eo: Ĉi tio konstante forigos vian registran ŝlosilon. Vi ne plu povos uzi la nuntempe registritan kromnomon.

source: Please choose a non empty nickname.
eo: Bonvolu elekti nemalplenan kromnomon.

source: Nickname already in use. Please choose another one
eo: Kromnomo jam uzata. Bonvolu elekti alian

# @title:window
source: Enter Your Nickname
eo: Enigu Vian Alinomon

source: Congratulations, you have won!
eo: Gratulon, vi venkis!

# @label:textbox
source: Enter your nickname:
eo: Enigu vian kromnomon:

# @option:check
source: Do not ask again.
eo: Ne demandu denove.

source: anonymous
eo: anonima

source: Games Count
eo: Ludoj Kalkulado

source: Comment
eo: Komento

source: Undefined error.
eo: Nedifinita eraro.

source: Missing argument(s).
eo: Mankas argumento(j).

source: Invalid argument(s).
eo: Nevalida(j) argumento(j).

source: Unable to connect to MySQL server.
eo: Ne eblas konektiĝi al MySQL-servilo.

source: Unable to select database.
eo: Ne eblas elekti datumbazon.

source: Error on database query.
eo: Eraro ĉe datumbaza konsulto.

source: Error on database insert.
eo: Eraro ĉe datumbaza enmeto.

source: Nickname already registered.
eo: Alnomo jam registrita.

source: Nickname not registered.
eo: Alnomo ne registrita.

source: Invalid key.
eo: Nevalida ŝlosilo.

source: Invalid submit key.
eo: Nevalida sendoŝlosilo.

source: Invalid level.
eo: Nevalida nivelo.

source: Invalid score.
eo: Nevalida poentaro.

source: Unable to contact world-wide highscore server
eo: Ne eblas kontakti servilon de tutmonda altpoentaro

source: Unable to open temporary file.
eo: Ne eblas malfermi provizoran dosieron.

source: Server URL: %1
eo: Servila URL: %1

# @title:window
source: Message from World-Wide High Scores Server
eo: Mesaĝo de Tutmonda Altpoenta Servilo

source: Invalid answer from world-wide highscores server.
eo: Nevalida respondo de tutmonda altpoenta servilo.

source: Raw message: %1
eo: Kruda mesaĝo: %1

source: Invalid answer from world-wide highscores server (missing item: %1).
eo: Nevalida respondo de tutmonda altpoenta servilo (mankas ero: %1).

source: all
eo: ĉiuj

source: Select player:
eo: Elekti ludanton:

source: Total:
eo: Totalo:

source: Won:
eo: Gajnita:

source: Lost:
eo: Perdita:

source: Draw:
eo: Egalpoenta:

source: Current:
eo: Aktuala:

source: Max won:
eo: Max venkita:

source: Max lost:
eo: Max perdita:

# @title:group
source: Game Counts
eo: Ludkalkuloj

# @title:group
source: Trends
eo: Tendencoj

# @title:column
source: From
eo: De

# @title:column
source: To
eo: Al

# @title:column
source: Count
eo: Nombro

# @title:column
source: Percent
eo: Procento

source: The speed of the animations.
eo: La rapideco de la animacioj.

source: Whether to play competitively in contrast to casually.
eo: Ĉu ludi konkure kontraste al distre.

source: Whether to use colored chips instead of black and white ones.
eo: Ĉu uzi kolorajn ĵetonojn anstataŭ nigrajn kaj blankajn.

source: &View
eo: &Rigardi

source: &Settings
eo: A&gordo

source: Main Toolbar
eo: Ĉefa ilobreto

source: Red can not perform any move. It is blue turn again.
eo: Ruĝa ne povas fari ajnan movon. Ĝi estas blua turniĝo denove.

source: White can not perform any move. It is black turn again.
eo: Blanka ne povas fari ajnan movon. Denove estas nigra turniĝo.

source: Blue can not perform any move. It is red turn again.
eo: Blua ne povas fari ajnan movon. Ĝi denove estas ruĝa turniĝo.

source: Black can not perform any move. It is white turn again.
eo: Nigro ne povas fari ajnan movon. Ĝi estas blanka turniĝo denove.

source: KReversi
eo: Renverso

source: KDE Reversi Board Game
eo: KDE Reversi Tabulludo

source: Original author
eo: Origina aŭtoro

source: Game rewrite for KDE4. Current maintainer.
eo: Ludo reverko por KDE4. Nuna prizorganto.

source: Action refactoring
eo: Ago-refaktorado

source: Game engine, ported from his JAVA applet.
eo: Ludmotoro, portita de lia JAVA apleto.

source: Original raytraced chips.
eo: Originalaj rayspuritaj ĵetonoj.

source: Vector chips and background for KDE4.
eo: Vektoraj ĵetonoj kaj fono por KDE4.

source: Port rendering code to KGameRenderer
eo: Porti bildigan kodon al KGameRenderer

source: Denis Kuplyakov
eo: Denis Kupljakov

source: Port rendering code to QML, redesign and a lot of improvements
eo: Porti bildigan kodon al QML, restrukturi kaj multajn plibonigojn

source: Start with demo game playing
eo: Komenci per demo-ludo

source: Press start game!
eo: Premu komenci ludon!

# @title:window
source: Move History
eo: Mova Historio

# @option:check
source: Show Last Move
eo: Montri Lastan Movon

# @option:check
source: Show Legal Moves
eo: Montri Laŭleĝajn Movojn

# @title:menu
source: Animation Speed
eo: Vigligorapideco

# @item:inmenu animation speed
source: Slow
eo: Malrapida

# @item:inmenu animation speed
source: Normal
eo: Normala

# @item:inmenu animation speed
source: Fast
eo: Rapida

# @option:check
source: Use Colored Chips
eo: Uzi Kolorajn Ĵetonojn

# @action
source: Show Move History
eo: Montri Mov-Historion

source: Game is drawn!
eo: Ludo estas egalpoenta!

source: You win!
eo: Vi gajnas!

source: You have lost!
eo: Vi perdis!

source: %1 has won!
eo: %1 venkis!

# @title:window
source: Game Over
eo: Ludo Finiĝis

source: %1 turn
eo: %1 vico

source: %1's turn
eo: La vico de %1

source: Computer
eo: Komputilo

# @title:window
source: New game
eo: Nova ludo

# @action:button
source: Start Game
eo: Komenci Ludon

source: Let's start playing!
eo: Ni komencu ludi!

# @action:button
source: Quit
eo: Forlasi

# @info:tooltip
source: Quit KReversi
eo: Forlasi KReversi

source: Name:
eo: Nomo:

source: Skill level:
eo: Kapablonivelo:
